app/controllers/api/articles_controller.rb

SELECT  "articles".* FROM "articles"   ORDER BY created_at desc LIMIT 5 OFFSET 0
---
  def index
    @articles = Article.order("created_at desc").page(params[:page]||1).per(params[:per]||5)