app/controllers/articles_controller.rb

INSERT INTO "articles" ("content", "created_at", "description", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["content", "afadsfadsadfs"], ["created_at", Mon, 14 Apr 2014 03:03:49 UTC +00:00], ["description", ""], ["title", "aaaaaa"], ["updated_at", Mon, 14 Apr 2014 03:03:49 UTC +00:00], ["user_id", 5]]
---
  def create
    @article = Article.new(article_params)
    @article.user_id=current_user.id
    if @article.save

SELECT  "articles".* FROM "articles"   ORDER BY created_at desc LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "articles"
---
  def index

    @articles = Article.order("created_at desc").page(params[:page]||1).per(params[:per]||20)

SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 24]]
UPDATE "articles" SET "content" = ?, "updated_at" = ? WHERE "articles"."id" = 24  [["content", "<img src=\"/uploads/image/201404/8ee51f17320d.jpg\" alt=\"\" width=\"300\" height=\"400\" title=\"\" align=\"\" />fasdf"], ["updated_at", "2014-04-22 05:59:17.595451"]]
---
  def update
    @article = Article.find(params[:id])
    @article.attributes = article_params
    if @article.save