app/controllers/mobiles_controller.rb

SELECT "articles".* FROM "articles"   ORDER BY created_at desc
---
  def index
    @articles = Article.order("created_at desc")