app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("avatar", "created_at", "email", "name", "password", "role", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["avatar", ""], ["created_at", Fri, 11 Apr 2014 10:11:40 UTC +00:00], ["email", ""], ["name", "aaa"], ["password", ""], ["role", ""], ["updated_at", Fri, 11 Apr 2014 10:11:40 UTC +00:00]]

  def index
    @users = User.order("created_at desc").page(params[:page]||1).per(params[:per]||10)
    @articles = Article.order("created_at desc").page(params[:page]||1).per(params[:per]||10)
---
SELECT  "users".* FROM "users"   ORDER BY created_at desc LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "users"
SELECT  "articles".* FROM "articles"   ORDER BY created_at desc LIMIT 10 OFFSET 0

  def update
    @user = User.find(params[:id])
    @user.attributes = user_params
    if @user.save
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 8  ORDER BY "users"."id" ASC LIMIT 1
UPDATE "users" SET "avatar_file_name" = ?, "avatar_content_type" = ?, "avatar_file_size" = ?, "avatar_updated_at" = ?, "updated_at" = ? WHERE "users"."id" = 6

  def destroy
    @user = User.find(params[:id])
    @user.destroy
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 8  ORDER BY "users"."id" ASC LIMIT 1
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]